
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекущуюСуммуВклада(ДатаАктуальности, Вклад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("Вклад", Вклад);
	Запрос.Текст = "ВЫБРАТЬ
	|	ВкладыОстатки.Вклад КАК Вклад,
	|	ВкладыОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.Инвест_Вклады.Остатки(&ДатаАктуальности, Вклад.КапитализацияПроцентов
	|	И НАЧАЛОПЕРИОДА(Вклад.ДатаОткрытияВклада, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)
	|	И КОНЕЦПЕРИОДА(Вклад.ДатаЗакрытияВклада, МЕСЯЦ) >= КОНЕЦПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)
	|	И Вклад = &Вклад) КАК ВкладыОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВкладыОбороты.Вклад,
	|	ВкладыОбороты.СуммаПриход
	|ИЗ
	|	РегистрНакопления.Инвест_Вклады.Обороты(, &ДатаАктуальности, Регистратор,
	|	НЕ Вклад.КапитализацияПроцентов
	|	И НАЧАЛОПЕРИОДА(Вклад.ДатаОткрытияВклада, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)
	|	И КОНЕЦПЕРИОДА(Вклад.ДатаЗакрытияВклада, МЕСЯЦ) >= КОНЕЦПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)
	|	И Вклад = &Вклад) КАК ВкладыОбороты
	|ГДЕ
	|	ВкладыОбороты.Регистратор ССЫЛКА Документ.Инвест_ОткрытиеВклада";
	Возврат Запрос.Выполнить().Выгрузить().Итог("Сумма");
	
КонецФункции

#КонецОбласти