
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Элементы.НадписьТекущаяСуммаВклада.Заголовок = "Текущая сумма вклада - " + ПолучитьТекущуюСуммуВклада();
КонецПроцедуры

&НаКлиенте
Процедура СрокВкладаПриИзменении(Элемент)
	РассчитатьСрокиВклада();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОткрытияВкладаПриИзменении(Элемент)
	РассчитатьСрокиВклада();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТекущуюСуммуВклада()
	Возврат Инвест_РаботаСВкладамиСервер.ПолучитьТекущуюСуммуВклада(ТекущаяДата(), РеквизитФормыВЗначение("Объект").Ссылка);
КонецФункции

&НаКлиенте
Процедура РассчитатьСрокиВклада()
	Объект.ДатаЗакрытияВклада = ДобавитьМесяц(Объект.ДатаОткрытияВклада, Объект.СрокВклада);
КонецПроцедуры


#КонецОбласти